
const goods = {
    '111': [
        {id: '10001', name: '红米', desc: '4800万像素'},
        {id: '10002', name: '小米电视', desc: '3800万像素'},
        {id: '10003', name: '小米小', desc: '4800万像素'},

    ],
    '222': [
        {id: '20001', name: '红米', desc: '4800万像素'},
        {id: '20002', name: '小米大', desc: '4800万像素'},
        {id: '20003', name: '小米小', desc: '4800万像素'},
    ]
};


const goods_detail = {
    '10001': {
        id: '10001',
        name: '红米',
        text: `陶瓷机身 手机中的艺术品 / 搭载高通骁龙845 年度旗舰处理器 / AI超感光双摄，DxO百分相机 / 高效 Qi 无线充电`,
        price: 1799,
    },
    '10002': {
        id: '10002',
        name: '黑米',
        text: `陶瓷机身 手机中的艺术品 / 搭载高通骁龙845 年度旗舰处理器 / AI超感光双摄，DxO百分相机 / 高效 Qi 无线充电`,
        price: 2799,
    },
    '10003': {
        id: '10003',
        name: '小米',
        text: `陶瓷机身 手机中的艺术品 / 搭载高通骁龙845 年度旗舰处理器 / AI超感光双摄，DxO百分相机 / 高效 Qi 无线充电`,
        price: 3799,
    }
};

module.exports = {
    goods,
    goods_detail
};
